apache/nuttx/arch/arm/src/nrf52/nrf52_adc.c
/****************************************************************************
 * arch/arm/src/nrf52/nrf52_adc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <string.h>
#include <assert.h>
#include <errno.h>

#include <nuttx/debug.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/analog/adc.h>
#include <nuttx/analog/ioctl.h>

#include "arm_internal.h"
#include "nrf52_gpio.h"
#include "nrf52_adc.h"
#ifdef CONFIG_NRF52_SAADC_CONTINUOUS
#  include "nrf52_ppi.h"
#endif

#ifdef CONFIG_NRF52_SAADC_TIMER_PPI
#  include "nrf52_ppi.h"
#  include "nrf52_tim.h"
#endif

#include "hardware/nrf52_saadc.h"
#include "hardware/nrf52_utils.h"
#ifdef CONFIG_NRF52_SAADC_TIMER_PPI
#  include "hardware/nrf52_ppi.h"
#  include "hardware/nrf52_tim.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#if !defined(CONFIG_NRF52_SAADC_TASK) && \
    !defined(CONFIG_NRF52_SAADC_TIMER) && \
    !defined(CONFIG_NRF52_SAADC_TIMER_PPI)
#  error SAADC trigger not selected
#endif

#if defined(CONFIG_NRF52_SAADC_TIMER_PPI) && \
    defined(CONFIG_NRF52_SAADC_CONTINUOUS)
#  if CONFIG_NRF52_SAADC_PPI_CHANNEL == CONFIG_NRF52_SAADC_CONTINUOUS_PPI_CH
#    error SAADC sample and restart PPI channels must differ
#  endif
#endif

#ifdef CONFIG_NRF52_SAADC_CONTINUOUS
/* Samples in each of the two EasyDMA buffers.  A scan is one conversion of
 * every enabled channel, so a buffer holds CONTINUOUS_BUFLEN whole scans.
 */

#  define NRF52_SAADC_DMALEN (CONFIG_NRF52_SAADC_CHANNELS * \
                              CONFIG_NRF52_SAADC_CONTINUOUS_BUFLEN)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct nrf52_adc_s
{
  /* Upper-half callback */

  const struct adc_callback_s *cb;

  /* Channels configuration */

  struct nrf52_adc_channel_s channels[CONFIG_NRF52_SAADC_CHANNELS];

  /* Samples buffer */

  int16_t                    buffer[CONFIG_NRF52_SAADC_CHANNELS];

#ifdef CONFIG_NRF52_SAADC_CONTINUOUS
  /* Double-buffered EasyDMA for gapless continuous sampling. The SAADC
   * fills one dmabuf while the driver processes the other; the PPI channel
   * auto-restarts the SAADC on END and the STARTED interrupt reloads the
   * DMA pointer to the free buffer. 'next' is the buffer being filled.
   *
   * With more than one channel enabled a buffer holds whole interleaved
   * scans and 'chanmap' carries the channel index of every sample.
   */

  int16_t                    dmabuf[2][NRF52_SAADC_DMALEN];
  uint32_t                   batch[NRF52_SAADC_DMALEN];
  uint8_t                    chanmap[NRF52_SAADC_DMALEN];
  uint16_t                   dmalen;  /* Samples per buffer: chan_len*BUFLEN */
  uint8_t                    next;
#endif

  uint8_t                    chan_len;   /* Configured channels */
  uint32_t                   base;       /* Base address of ADC register */
  uint32_t                   irq;        /* ADC interrupt */
  uint8_t                    resolution; /* ADC resolution */
#ifdef CONFIG_NRF52_SAADC_TIMER_PPI
  struct nrf52_tim_dev_s    *tim;        /* Timer used for PPI sampling */
  bool                       ppi_en;     /* PPI channel enabled */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* ADC Register access */

static inline void nrf52_adc_putreg(struct nrf52_adc_s *priv,
                                    uint32_t offset,
                                    uint32_t value);
static inline uint32_t nrf52_adc_getreg(struct nrf52_adc_s *priv,
                                        uint32_t offset);

/* ADC helpers */

static int nrf52_adc_configure(struct nrf52_adc_s *priv);
static int nrf52_adc_calibrate(struct nrf52_adc_s *priv);
static uint32_t nrf52_adc_ch_config(struct nrf52_adc_channel_s *cfg);
static uint32_t nrf52_adc_chanpsel(int psel);
static int nrf52_adc_chancfg(struct nrf52_adc_s *priv, uint8_t chan,
                             struct nrf52_adc_channel_s *cfg);
static int nrf52_adc_isr(int irq, void *context, void *arg);
#ifdef CONFIG_NRF52_SAADC_TIMER_PPI
static int nrf52_adc_ppi_setup(struct nrf52_adc_s *priv);
static void nrf52_adc_ppi_shutdown(struct nrf52_adc_s *priv);
static int nrf52_adc_ppi_start(struct nrf52_adc_s *priv);
#endif

/* ADC Driver Methods */

static int  nrf52_adc_bind(struct adc_dev_s *dev,
                           const struct adc_callback_s *callback);
static void nrf52_adc_reset(struct adc_dev_s *dev);
static int  nrf52_adc_setup(struct adc_dev_s *dev);
static void nrf52_adc_shutdown(struct adc_dev_s *dev);
static void nrf52_adc_rxint(struct adc_dev_s *dev, bool enable);
static int  nrf52_adc_ioctl(struct adc_dev_s *dev, int cmd,
                            unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* ADC interface operations */

static const struct adc_ops_s g_nrf52_adcops =
{
  .ao_bind        = nrf52_adc_bind,
  .ao_reset       = nrf52_adc_reset,
  .ao_setup       = nrf52_adc_setup,
  .ao_shutdown    = nrf52_adc_shutdown,
  .ao_rxint       = nrf52_adc_rxint,
  .ao_ioctl       = nrf52_adc_ioctl,
};

/* SAADC device */

struct nrf52_adc_s g_nrf52_adcpriv =
{
  .cb         = NULL,
  .base       = NRF52_SAADC_BASE,
  .irq        = NRF52_IRQ_SAADC,
  .resolution = CONFIG_NRF52_SAADC_RESOLUTION,
#ifdef CONFIG_NRF52_SAADC_TIMER_PPI
  .tim        = NULL,
  .ppi_en     = false
#endif
};

