apache/nuttx/arch/arm/src/nrf52/nrf52_adc.c
/* Upper-half ADC device */

static struct adc_dev_s g_nrf52_adc =
{
  .ad_ops      = &g_nrf52_adcops,
  .ad_priv     = &g_nrf52_adcpriv,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_adc_putreg
 *
 * Description:
 *   Put a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void nrf52_adc_putreg(struct nrf52_adc_s *priv,
                                    uint32_t offset,
                                    uint32_t value)
{
  DEBUGASSERT(priv);

  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: nrf52_adc_getreg
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 ****************************************************************************/

static inline uint32_t nrf52_adc_getreg(struct nrf52_adc_s *priv,
                                        uint32_t offset)
{
  DEBUGASSERT(priv);

  return getreg32(priv->base + offset);
}

#ifdef CONFIG_NRF52_SAADC_TIMER_PPI
/****************************************************************************
 * Name: nrf52_adc_tim_base
 *
 * Description:
 *   Get TIMER base address for configured SAADC PPI trigger timer.
 *
 ****************************************************************************/

static inline uint32_t nrf52_adc_tim_base(void)
{
#if CONFIG_NRF52_SAADC_PPI_TIMER == 0
  return NRF52_TIMER0_BASE;
#elif CONFIG_NRF52_SAADC_PPI_TIMER == 1
  return NRF52_TIMER1_BASE;
#elif CONFIG_NRF52_SAADC_PPI_TIMER == 2
  return NRF52_TIMER2_BASE;
#elif CONFIG_NRF52_SAADC_PPI_TIMER == 3
  return NRF52_TIMER3_BASE;
#elif CONFIG_NRF52_SAADC_PPI_TIMER == 4
  return NRF52_TIMER4_BASE;
#else
#  error Unsupported CONFIG_NRF52_SAADC_PPI_TIMER value
#endif
}

/****************************************************************************
 * Name: nrf52_adc_ppi_setup
 *
 * Description:
 *   Configure a general purpose TIMER and route its compare event to SAADC
 *   SAMPLE task over PPI.
 *
 ****************************************************************************/

static int nrf52_adc_ppi_setup(struct nrf52_adc_s *priv)
{
  uint32_t tim_base = 0;
  uint32_t ppi_ch   = CONFIG_NRF52_SAADC_PPI_CHANNEL;
  int      ret      = OK;

  DEBUGASSERT(priv);

  priv->tim = nrf52_tim_init(CONFIG_NRF52_SAADC_PPI_TIMER);
  if (priv->tim == NULL)
    {
      aerr("ERROR: failed to get TIMER%d for SAADC PPI\n",
           CONFIG_NRF52_SAADC_PPI_TIMER);
      ret = -EBUSY;
      goto errout;
    }

  tim_base = nrf52_adc_tim_base();

  /* Configure TIMER for periodic compare events */

  NRF52_TIM_STOP(priv->tim);
  NRF52_TIM_CLEAR(priv->tim);
  NRF52_TIM_CONFIGURE(priv->tim, NRF52_TIM_MODE_TIMER, NRF52_TIM_WIDTH_32B);
  NRF52_TIM_SETPRE(priv->tim, CONFIG_NRF52_SAADC_PPI_PRE);
  NRF52_TIM_SETCC(priv->tim, NRF52_TIM_CC0, CONFIG_NRF52_SAADC_PPI_CC);
  NRF52_TIM_SHORTS(priv->tim, NRF52_TIM_SHORT_COMPARE_CLEAR,
                   NRF52_TIM_CC0, true);

  /* Ensure compare event is clear before enabling PPI channel */

  putreg32(0, tim_base + NRF52_TIM_EVENTS_COMPARE_OFFSET(0));

  if ((getreg32(NRF52_PPI_CHEN) & PPI_CHEN_CH(ppi_ch)) != 0)
    {
      aerr("ERROR: PPI channel %ld already in use\n", (long)ppi_ch);
      ret = -EBUSY;
      goto errout;
    }

  nrf52_ppi_set_event_ep(ppi_ch,
                         tim_base + NRF52_TIM_EVENTS_COMPARE_OFFSET(0));
  nrf52_ppi_set_task_ep(ppi_ch,
                        priv->base + NRF52_SAADC_TASKS_SAMPLE_OFFSET);
  nrf52_ppi_channel_enable(ppi_ch, true);
  priv->ppi_en = true;

errout:
  if (ret < 0)
    {
      nrf52_adc_ppi_shutdown(priv);
    }

  return ret;
}

/****************************************************************************
 * Name: nrf52_adc_ppi_start
 *
 * Description:
 *   Start TIMER used for PPI-driven sampling.
 *
 ****************************************************************************/

static int nrf52_adc_ppi_start(struct nrf52_adc_s *priv)
{
  int ret = OK;

  DEBUGASSERT(priv);
  DEBUGASSERT(priv->tim != NULL);

  /* Clear event/counter and then start periodic triggering */

  NRF52_TIM_STOP(priv->tim);
  NRF52_TIM_CLEAR(priv->tim);
  ret = NRF52_TIM_START(priv->tim);

  return ret;
}

/****************************************************************************
 * Name: nrf52_adc_ppi_shutdown
 *
 * Description:
 *   Release TIMER/PPI resources used for PPI-driven sampling.
 *
 ****************************************************************************/

static void nrf52_adc_ppi_shutdown(struct nrf52_adc_s *priv)
{
  uint32_t ppi_ch = CONFIG_NRF52_SAADC_PPI_CHANNEL;

  DEBUGASSERT(priv);

  if (priv->ppi_en)
    {
      nrf52_ppi_channel_enable(ppi_ch, false);
      priv->ppi_en = false;
    }

  if (priv->tim != NULL)
    {
      NRF52_TIM_SHORTS(priv->tim, NRF52_TIM_SHORT_COMPARE_CLEAR,
                       NRF52_TIM_CC0, false);
      NRF52_TIM_STOP(priv->tim);
      nrf52_tim_deinit(priv->tim);
      priv->tim = NULL;
    }
}
#endif

/****************************************************************************
 * Name: nrf52_adc_isr
 *
 * Description:
 *   Common ADC interrupt service routine
 *
 ****************************************************************************/

static int nrf52_adc_isr(int irq, void *context, void *arg)
{
  struct adc_dev_s   *dev  = (struct adc_dev_s *) arg;
  struct nrf52_adc_s *priv = NULL;
  int                 ret  = OK;
  int                 i    = 0;

  DEBUGASSERT(dev);

  priv = (struct nrf52_adc_s *) dev->ad_priv;
  DEBUGASSERT(priv);

  ainfo("nrf52_adc_isr\n");

#ifdef CONFIG_NRF52_SAADC_CONTINUOUS
  /* END event: the current DMA buffer is full. Hand it to the upper half
   * as a batch. The PPI channel has already retriggered START (into the
   * buffer the STARTED handler preloaded). END must be handled before
   * STARTED - both can be pending at once: END consumes priv->next and
   * advances it, then STARTED uses the advanced value to reload the free
   * buffer's DMA pointer.
   */

