apache/nuttx/arch/arm/src/nrf52/nrf52_adc.c
  if (nrf52_adc_getreg(priv, NRF52_SAADC_EVENTS_END_OFFSET) == 1)
    {
      DEBUGASSERT(priv->cb != NULL);
      DEBUGASSERT(priv->cb->au_receive_batch != NULL);

      /* Give the completed buffer to the ADC driver */

      for (i = 0; i < priv->dmalen; i += 1)
        {
          priv->batch[i] = (uint32_t)priv->dmabuf[priv->next][i];
        }

      ret = priv->cb->au_receive_batch(dev, priv->chanmap, priv->batch,
                                       priv->dmalen);
      if (ret == -ENOMEM)
        {
          /* Receive FIFO overrun */

          DEBUGASSERT(priv->cb->au_reset != NULL);
          priv->cb->au_reset(dev);
        }

      /* The next END completes the other buffer */

      priv->next ^= 1;

      /* Clear event (read back to flush the write so the IRQ does not
       * spuriously re-fire before the clear takes effect).
       */

      nrf52_adc_putreg(priv, NRF52_SAADC_EVENTS_END_OFFSET, 0);
      (void)nrf52_adc_getreg(priv, NRF52_SAADC_EVENTS_END_OFFSET);
    }

  /* STARTED event: the SAADC latched the preloaded pointer and began
   * sampling. Point the DMA pointer at the other (now free) buffer so the
   * PPI END->START restart fills it next.
   */

  if (nrf52_adc_getreg(priv, NRF52_SAADC_EVENTS_STARTED_OFFSET) == 1)
    {
      nrf52_adc_putreg(priv, NRF52_SAADC_PTR_OFFSET,
                       (uint32_t)&priv->dmabuf[priv->next ^ 1]);

      /* Clear event (read back to flush the write) */

      nrf52_adc_putreg(priv, NRF52_SAADC_EVENTS_STARTED_OFFSET, 0);
      (void)nrf52_adc_getreg(priv, NRF52_SAADC_EVENTS_STARTED_OFFSET);
    }
#else
  /* END event */

  if (nrf52_adc_getreg(priv, NRF52_SAADC_EVENTS_END_OFFSET) == 1)
    {
      DEBUGASSERT(priv->cb != NULL);
      DEBUGASSERT(priv->cb->au_receive != NULL);

      /* Give the ADC data to the ADC driver */

      for (i = 0; i < priv->chan_len; i += 1)
        {
          priv->cb->au_receive(dev, i, priv->buffer[i]);
        }

      /* Clear event */

      nrf52_adc_putreg(priv, NRF52_SAADC_EVENTS_END_OFFSET, 0);

#if defined(CONFIG_NRF52_SAADC_TIMER) || defined(CONFIG_NRF52_SAADC_TIMER_PPI)
      /* In timer mode, END means the DMA buffer is full.  Re-start the
       * SAADC so that the trigger source keeps producing conversions
       * after a single ANIOC_TRIGGER.  This applies to both the internal
       * sample timer and an external TIMER feeding SAMPLE over PPI.
       */

      nrf52_adc_putreg(priv, NRF52_SAADC_TASKS_START_OFFSET, 1);
#endif
    }
#endif

  return ret;
}

/****************************************************************************
 * Name: nrf52_adc_configure
 *
 * Description:
 *   Configure ADC
 *
 ****************************************************************************/

static int nrf52_adc_configure(struct nrf52_adc_s *priv)
{
  int regval = 0;
#ifdef CONFIG_NRF52_SAADC_CONTINUOUS
  int i      = 0;
#endif

  DEBUGASSERT(priv);

  /* Configure ADC resolution */

  regval = CONFIG_NRF52_SAADC_RESOLUTION;
  nrf52_adc_putreg(priv, NRF52_SAADC_RESOLUTION_OFFSET, regval);

  /* Configure oversampling */

  regval = CONFIG_NRF52_SAADC_OVERSAMPLE;
  nrf52_adc_putreg(priv, NRF52_SAADC_OVERSAMPLE_OFFSET, regval);

  /* Configure sample rate */

#ifdef CONFIG_NRF52_SAADC_TIMER
  /* Sampling driven by the SAADC internal timer */

  regval = SAADC_SAMPLERATE_MODE_TIMERS;
  regval |= ((CONFIG_NRF52_SAADC_TIMER_CC & SAADC_SAMPLERATE_CC_MASK)
             << SAADC_SAMPLERATE_CC_SHIFT);
#else
  /* Sampling driven by the SAMPLE task, written either by the CPU
   * (NRF52_SAADC_TASK) or by a TIMER compare event over PPI
   * (NRF52_SAADC_TIMER_PPI).
   */

  regval = SAADC_SAMPLERATE_MODE_TASK;
#endif

  nrf52_adc_putreg(priv, NRF52_SAADC_SAMPLERATE_OFFSET, regval);

  /* Configure ADC buffer */

#ifdef CONFIG_NRF52_SAADC_CONTINUOUS
  /* Continuous mode: gapless double-buffered DMA auto-restarted by PPI.
   * Each buffer holds CONTINUOUS_BUFLEN scans of all enabled channels.
   */

  priv->next   = 0;
  priv->dmalen = priv->chan_len * CONFIG_NRF52_SAADC_CONTINUOUS_BUFLEN;

  DEBUGASSERT(priv->dmalen <= SAADC_MAXCNT_MASK);

  /* Samples are interleaved scan by scan, so the channel index simply
   * cycles.  Build the map once instead of per interrupt.
   */

  for (i = 0; i < priv->dmalen; i += 1)
    {
      priv->chanmap[i] = i % priv->chan_len;
    }

  regval = (uint32_t)&priv->dmabuf[0];
  DEBUGASSERT(nrf52_easydma_valid(regval));
  nrf52_adc_putreg(priv, NRF52_SAADC_PTR_OFFSET, regval);

  nrf52_adc_putreg(priv, NRF52_SAADC_MAXCNT_OFFSET, priv->dmalen);

  /* Auto-restart the SAADC: END event -> START task via PPI */

  nrf52_ppi_set_event_ep(CONFIG_NRF52_SAADC_CONTINUOUS_PPI_CH,
                         priv->base + NRF52_SAADC_EVENTS_END_OFFSET);
  nrf52_ppi_set_task_ep(CONFIG_NRF52_SAADC_CONTINUOUS_PPI_CH,
                        priv->base + NRF52_SAADC_TASKS_START_OFFSET);
#else
  regval = (uint32_t)&priv->buffer;
  DEBUGASSERT(nrf52_easydma_valid(regval));
  nrf52_adc_putreg(priv, NRF52_SAADC_PTR_OFFSET, regval);

  regval = priv->chan_len;
  DEBUGASSERT(regval <= SAADC_MAXCNT_MASK);
  nrf52_adc_putreg(priv, NRF52_SAADC_MAXCNT_OFFSET, regval);
#endif

  return OK;
}

/****************************************************************************
 * Name: nrf52_adc_calibrate
 *
 * Description:
 *   Calibrate ADC
 *
 ****************************************************************************/

static int nrf52_adc_calibrate(struct nrf52_adc_s *priv)
{
  /* Clear Event */

  nrf52_adc_putreg(priv, NRF52_SAADC_EVENTS_CALDONE_OFFSET, 0);

  /* Start calibration */

  nrf52_adc_putreg(priv, NRF52_SAADC_TASKS_CALOFFSET_OFFSET, 1);

  /* Wait for calibration done */

  while (nrf52_adc_getreg(priv, NRF52_SAADC_EVENTS_CALDONE_OFFSET) != 1);

  return OK;
}

/****************************************************************************
 * Name: nrf52_adc_ch_config
 ****************************************************************************/

static uint32_t nrf52_adc_ch_config(struct nrf52_adc_channel_s *cfg)
{
  uint32_t regval = 0;

  /* Positive channel resistor control */

  switch (cfg->resp)
    {
      case NRF52_ADC_RES_BYPASS:
        {
          regval |= SAADC_CONFIG_RESP_NONE;
          break;
        }

